export default function TermsIndex() {
  return (
    <section className="flex items-center justify-center px-10">
      <div className="flex flex-col gap-20 items-center lg:w-[90%]">
        <div className="flex flex-col items-center gap-3">
          <h3 className="lg:text-5xl text-4xl font-kalmeh">قوانین و مقررات سایت</h3>
          <p className="lg:text-2xl text-lg text-foreground/80">در این صفحه شرایط استفاده از وبسایت آموزشی راکت را مشاهده میکنید.</p>
        </div>
        <div className="flex flex-col space-y-4 bg-white dark:bg-slate-900 text-lg text-foreground/60 rounded-lg p-10">
          <h1>به کپسول خوش آمدید.</h1>
          <p>
            هر سرویس دهنده‌ای در دنیای واقعی و مجازی بر پایه یک سری قوانین و مقررات بنا شده است تا بتواند محیط عادلانه و بهتری برای مخاطبان خود ایجاد کند. به همین منظور ما در کپسول یک سری قوانین و مقررات را گرده هم آورده‌ایم، که به شرح زیر آنها را توضیح خواهیم داد . دقت کنید عضویت در سایت و ساخت
            کپسول ، به منزله مطالعه و قبول قوانین و مقررات مربوطه است.
          </p>
          <h2 className="text-primary text-3xl font-bold mt-6">قوانین حساب کاربری</h2>
          <p>اکثر امکانات کپسول مربوط به اعضای آن می شود و اگر شما قصد استفاده از این دسته از محتوا را دارید، نیاز است ابتدا در سایت کپسول عضو شوید، داشتن یک حساب کاربری ملزم به رعایت قوانین زیر می باشد :‌</p>
          <ul className="list-disc lg:px-14 px-8 text-lg">
            <li>شما موظف هستید در هنگام عضویت در سایت تمام اطلاعات را به شکل صحیح و معتبر وارد کنید، از جمله ایمیل</li>
            <li>در صورتی که فرد دیگری بدون اجازه شما به اطلاعات کاربری شما دسترسی پیدا کرد حتما در اولین فرصت به ما گزارش دهید.</li>
            <li>از در اختیار گذاشتن نام کاربری و رمز عبور خود به اشخاص ثالث خودداری کنید زیرا شما مسئول اتفاقاتی هستید که به پروفایل کاربری شما مرتبط می گردد.</li>
            <li>هر حساب کاربری تنها مجاز است توسط یک شخص استفاده شود، در صورت استفاده چندین شخص از یک اکانت راکت این حق را برای خود محفوظ می داند که اکانت مورد نظر را مسدود نماید.</li>
            <li>استفاده از هرگونه نام جعلی یا تقلبی و یا ایمیل نامعتبر در جهت سو استفاده های احتمالی یا نقض حقوق اشخاص دیگر موجب مسدود شدن حساب کاربری میگردد.</li>
            <li>شما حق ندارید هویت و موقعیتِ جغرافیایِ خودتان را پنهان کنید یا به شکلی دیگر جلوه دهید. شما حق ندارید خودتان را جایِ کسی دیگر معرفی کنید.</li>
          </ul>
          <h2 className="text-primary text-3xl font-bold mt-6">حریم شخصی کاربران</h2>
          <p>امروزه حفظ حریم شخصی برای اکثر افراد جامعه بسیار مهم است، همانطور که این مسئله برای ما مهم است . ما در کپسول سعی داریم با حفظ حریم شخصی شما، حاشیه امنی برای فعالیتتان در کپسول بوجود آوریم.</p>
          <p>اطلاعاتی که از شما در روند عضویت یا در بخش پروفایل سازی دریافت میکنیم نزد کپسول محفوظ مانده و در اختیار شخص حقیقی یا حقوقی ثالث به جز در مواردی که به درخواست قانون و مراجع ذی صلاح الزام آور باشد، قرار نخواهد گرفت.</p>
          <h2 className="text-primary text-3xl font-bold mt-6">ساخت کپسول عمومی</h2>
          <p>در صورت مشاهده هرگونه از موارد زیر در بخش کپسول‌های عمومی و همچنین کپسولی که توسط شما ایجاد شده، حذف خواهد گردید و در صورت تکرار حساب کاربری شما بسته خواهد شد:</p>
          <ul className="list-disc lg:px-14 px-8 text-lg">
            <li>هر گونه نشر محتوا برخلاف قوانین جمهوری اسلامی ایران و یا خلاف قوانین جرایم اینترنتی</li>
            <li>نشر محتوای نادرست، گمراه کننده، فریبنده، رکیک و بر خلاف شئونات عرف جامعه</li>
            <li>هر گونه توهین به اشخاص ثالث و تجاوز به حریم خصوصی آن ها</li>
            <li>محتوای حاوی ویروس، جاسوس افزار و موارد مشابه</li>
            <li>هرگونه محتوا حاوی هرزنامه</li>
            <li>اطلاعات شخصی یا حساس افراد ثالث</li>
          </ul>
          <h2 className="text-primary text-3xl font-bold mt-6">حقوق مالکیت معنوی</h2>
          <ul className="list-disc lg:px-14 px-8 text-lg">
            <li>شما با ارسال نظرات، پیشنهادات، ایده ها و هرگونه محتوا برای ما به ما مجوز استفاده از آن برای نشر و به اشتراک گذاری مثلا در موارد تبلیغاتی را خواهید داد.</li>
            <li>وب سایت و کلیه مطالب، شامل محتوای متنی و رسانه ای سایت ، متعلق به کپسول می باشد و از قانون کپی رایت جمهوری اسلامی ایران تبعیت میکند.</li>
            <li>هر گونه توهین به اشخاص ثالث و تجاوز به حریم خصوصی آن ها</li>
            <li>تمام اطلاعاتی که ما در وب سایت جمع آوری می کنیم زیر نظر سیاست حفظ حریم خصوصی می باشد.</li>
            <li>شما حق استفاده از بخشی از کپسول ها تصاویر و یا متن به شکل جدا شده از بستر اصلی آن را برای استفاده تجاری یا بازنشر آن نخواهید داشت.</li>
          </ul>
          <h2 className="text-primary text-3xl font-bold mt-6">نظارت بر محتوا</h2>
          <p>کپسول حق دارد به صلاحدیدِ خود نوشته‌هایِ کاربران و تولیدکنندگان محتوا که رویِ سرویس قرار می‌گیرند و از قوانین سایت تبعیت نمی کنند را ویرایش و حذف و یا کلا از انتشارِ آن جلوگیری کند. ما در کپسول سعی داریم محتوای سالم و به دور از هر گونه توهینی داشته باشیم .</p>
          <h2 className="text-primary text-3xl font-bold mt-6">عدم رعایت قوانین</h2>
          <p>
            در صورت عدم رعایت قوانین مندرج شده در این صفحه، کپسول این حق را برای خود محفوظ می‌دارد که بلافاصله دسترسی شما به وبسایت را معلق کند یا به طور کلی به پایان برساند و اکانتِ شما (یا بخشی از آن) را مسدود کند. کپسول حق دارد هرکدام از موارد ذکر شده در ذیل را تغییر دهد یا به صورتِ دائم یا موقت
            مسدود کند:
          </p>
          <ul className="list-disc lg:px-14 px-8 text-lg">
            <li>محدود کردنِ شما از دسترسی به بخش یا تمام محتوای قابل استفاده در اکانت شما</li>
          </ul>
          <h2 className="text-primary text-3xl font-bold mt-6">امنیت وبسایت</h2>
          <p>امنیت بخش مهمی از هر سایت به شمار می آید، که حفظ آن باعث ایجاد فضای راحت تر بین افرادی که از یک سرویس استفاده میکنند می شود . شما با عضویت در کپسول تعهد میدهید :‌</p>
          <ul className="list-disc lg:px-14 px-8 text-lg">
            <li>هیچ گونه کاری که باعث از کار افتادن، یا آسیب و حمله به وبسایت شود را انجام ندهید.</li>
            <li>از هیچ گونه ربات یا نرم افزارهای مشابه برای دسترسی به محتوای محرمانه و یا رسیدن به یک هدف غیر قانونی یا نقض قوانین وبسایت استفاده نکنید.</li>
            <li>از هیچ گونه ویروس، تروجان، کرم و موارد مخرب مشابه دیگر برای اسیب رساندن به وبسایت استفاده ننمایید.</li>
            <li>هیچ گونه هرزنامه‌ای در بخش نظرات و گفتگو وارد نکنید.</li>
          </ul>
          <p>
            اگر وب سایت حاوی لینک ها به سایت های دیگر و منابع ارائه شده توسط اشخاص ثالث باشد، این لینک ها فقط برای راحتی شما ارائه می شوند. ما هیچگونه مسئولیتی در قبال محتوای آن سایت یا منابع نداریم و هیچ گونه مسئولیتی در قبال آنها و یا از دست دادن یا خسارت ناشی به علت استفاده شما از آنها را نداریم.
          </p>
          <h2 className="text-primary text-3xl font-bold mt-6">تغییرات</h2>
          <p>ما میتوانیم در هر زمان بر اساس نیاز سیاست‌های سایت کپسول را تغییر دهیم، بخش‌های از قوانین را حذف و یا تغییر دهیم یا بندهای به آن اضافه کنیم . البته بعد از هرگونه تغییر، ادامه فعالیت شما در کپسول به منزله موافق بودن با قوانین جدید به شمار می آید.</p>
          <p>در صورت عدم توجه و رعایت قوانین جدید، کپسول این حق را برای خود محفوظ میدارد که اکانت شما را مسدود یا به شکل کامل حذف کند</p>
        </div>
      </div>
    </section>
  );
}
